In [1]:
import pandas as pd
df = pd.read_csv("supershops.csv")

In [2]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Min Max Scaler

In [3]:
from sklearn.preprocessing import MinMaxScaler
m = MinMaxScaler()

In [4]:
scaled1 = m.fit(df[["Marketing Spend"]])

In [5]:
scaled1

MinMaxScaler()

In [6]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [7]:
df["Marketing Spend"] = m.transform(df[["Marketing Spend"]])

In [8]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [9]:
df.Administration = m.fit_transform(df[["Administration"]])

In [10]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [11]:
df.Transport = m.fit_transform(df[["Transport"]])

In [12]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

In [13]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [14]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [15]:
df.Administration.max()

182645.56

In [16]:
df.Administration = df.Administration / df.Administration.max()

In [17]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.749527  471784.10    Dhaka  192261.83
1        162597.70        0.828805  443898.53      Ctg  191792.06
2        153441.51        0.553781  407934.54  Rangpur  191050.39
3        144372.41        0.649738  383199.62    Dhaka  182901.99
4        142107.34        0.500378  366168.42  Rangpur  166187.94

# standard scaler

In [18]:
from sklearn.preprocessing import StandardScaler
s = StandardScaler()

In [19]:
scaled2 = s.fit(df[["Marketing Spend"]])

In [20]:
scaled2

StandardScaler()

In [21]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.749527  471784.10    Dhaka  192261.83
1        162597.70        0.828805  443898.53      Ctg  191792.06
2        153441.51        0.553781  407934.54  Rangpur  191050.39
3        144372.41        0.649738  383199.62    Dhaka  182901.99
4        142107.34        0.500378  366168.42  Rangpur  166187.94

In [22]:
df["Marketing Spend"] = s.transform(df[["Marketing Spend"]])

In [23]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.749527  471784.10    Dhaka  192261.83
1         1.955860        0.828805  443898.53      Ctg  191792.06
2         1.754364        0.553781  407934.54  Rangpur  191050.39
3         1.554784        0.649738  383199.62    Dhaka  182901.99
4         1.504937        0.500378  366168.42  Rangpur  166187.94

In [24]:
df.Administration = s.fit_transform(df[['Administration']])

In [25]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753  471784.10    Dhaka  192261.83
1         1.955860        1.082807  443898.53      Ctg  191792.06
2         1.754364       -0.728257  407934.54  Rangpur  191050.39
3         1.554784       -0.096365  383199.62    Dhaka  182901.99
4         1.504937       -1.079919  366168.42  Rangpur  166187.94

In [26]:
df.Transport = s.fit_transform(df[['Transport']])

In [27]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# max abs scaler

In [28]:
import pandas as pd
df = pd.read_csv("supershops.csv")

In [29]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [30]:
df.tail()

    Marketing Spend  Administration  Transport     Area    Profit
45          1000.23       124153.04    1903.93    Dhaka  64926.08
46          1315.46       115816.21  297114.46  Rangpur  49490.75
47             0.00       135426.92       0.00      Ctg  42559.73
48           542.05        51743.15       0.00    Dhaka  35673.41
49             0.00       116983.80   45173.06      Ctg  14681.40

In [32]:
df.dtypes

Marketing Spend    float64
Administration     float64
Transport          float64
Area                object
Profit             float64
dtype: object

In [33]:
from sklearn.preprocessing import MaxAbsScaler
mx = MaxAbsScaler()

In [34]:
scaled3 = mx.fit(df[["Marketing Spend"]])

In [35]:
scaled3

MaxAbsScaler()

In [36]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [37]:
df.Administration = mx.fit_transform(df[['Administration']])

In [38]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.749527  471784.10    Dhaka  192261.83
1        162597.70        0.828805  443898.53      Ctg  191792.06
2        153441.51        0.553781  407934.54  Rangpur  191050.39
3        144372.41        0.649738  383199.62    Dhaka  182901.99
4        142107.34        0.500378  366168.42  Rangpur  166187.94

In [39]:
df.Transport = mx.fit_transform(df[['Transport']])

In [40]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.749527   1.000000    Dhaka  192261.83
1        162597.70        0.828805   0.940893      Ctg  191792.06
2        153441.51        0.553781   0.864664  Rangpur  191050.39
3        144372.41        0.649738   0.812235    Dhaka  182901.99
4        142107.34        0.500378   0.776136  Rangpur  166187.94

# robust scaler

In [44]:
import pandas as pd
df = pd.read_csv("supershops.csv")

In [45]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [46]:
from sklearn.preprocessing import RobustScaler
rb = RobustScaler()

In [47]:
scaled4 = rb.fit(df[["Marketing Spend"]])

In [48]:
scaled4

RobustScaler()

In [49]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [50]:
df.Administration = rb.fit_transform(df[['Administration']])

In [51]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.345355  471784.10    Dhaka  192261.83
1        162597.70        0.697565  443898.53      Ctg  191792.06
2        153441.51       -0.524290  407934.54  Rangpur  191050.39
3        144372.41       -0.097977  383199.62    Dhaka  182901.99
4        142107.34       -0.761543  366168.42  Rangpur  166187.94

In [52]:
df.Transport = rb.fit_transform(df[['Transport']])

In [53]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.345355   1.552016    Dhaka  192261.83
1        162597.70        0.697565   1.383714      Ctg  191792.06
2        153441.51       -0.524290   1.166654  Rangpur  191050.39
3        144372.41       -0.097977   1.017368    Dhaka  182901.99
4        142107.34       -0.761543   0.914576  Rangpur  166187.94